# Reading and Writing Data in Text Format

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Reading and writing data in text formats
- `read_csv` and `read_table` are some of the most used pandas function for reading tabular data such as tables and csv files as Dataframe objects.
- Here, I have a small comma seperated data set for daily sales of product:
`daily_sales_data_0` etc. 
- Since the `daily_sales_data_0` is **Comma** seperated or delimited, we can use read_csv function to read it into dataframe.

### ðŸ“ŒFeatures
1. _Type Inference_: we don't have to specify the data type of each column.

In [2]:
# read_csv function used ',' as by default delimiter
df = pd.read_csv('daily_sales_data_0.csv')

In [3]:
df.head() # returns first n rows, default 5

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

- However, we can use `read_table` function also by providing an seperator attribute as comma.

In [4]:
pd.read_table('daily_sales_data_1.csv', sep=",").head()

       product  price  quantity        date region
0  pink morsel  $3.00       545  2019-06-11  north
1  pink morsel  $3.00       521  2019-06-11  south
2  pink morsel  $3.00       595  2019-06-11   east
3  pink morsel  $3.00       507  2019-06-11   west
4  gold morsel  $9.99       529  2019-06-11  north

### Assigning our own headers or no header at all

In [7]:
# pandas default header
pd.read_csv('daily_sales_data_1.csv', header=None).head()

             0      1         2           3       4
0      product  price  quantity        date  region
1  pink morsel  $3.00       545  2019-06-11   north
2  pink morsel  $3.00       521  2019-06-11   south
3  pink morsel  $3.00       595  2019-06-11    east
4  pink morsel  $3.00       507  2019-06-11    west

In [14]:
# User-Defined Header
pd.read_csv('daily_sales_data_1.csv', names=['a', 'b', 'c', 'd', 'e']).head()

             a      b         c           d       e
0      product  price  quantity        date  region
1  pink morsel  $3.00       545  2019-06-11   north
2  pink morsel  $3.00       521  2019-06-11   south
3  pink morsel  $3.00       595  2019-06-11    east
4  pink morsel  $3.00       507  2019-06-11    west